Autodesk.Revit.DB.GeometryCreationUtilities.CreateLoftGeometry(System.Collections.Generic.IList`1{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.SolidOptions)
Creates a solid or open shell geometry by lofting between a sequence of curve loops.
Remarks:
If all the curve loops are closed it will create a solid.
If all the curve loops are open, then create an open shell.
If there are both open and closed loops, only the first and/or last loop are allowed to be open,
others (if they exist) must be closed. A solid will be created in this case.
The surface of the solid or open shell will pass through these profiles blending smoothly between the profiles.
Each profile loop must be free of intersections and degeneracies. No orientation conditions on the loops are imposed.
profileLoops:
The array of curve loops, where the order of the array determines the lofting sequence used.
solidOptions:
The optional information to control the properties of the solid or open shell.
Returns:
The requested solid or open shell.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The number of profile CurveLoops is less than 2.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016